;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! academic-phrases)
(package! company-bibtex)
(package! form-feed)
(package! writegood-mode)
(package! pandoc-mode)
(package! rainbow-mode)
(package! yasnippet-snippets)
(package! ivy-bibtex)
(package! org-journal)
(package! sublimity)
(package! typo)
